JeffZ0930wtf/TUSS4470_Jetson/firmware/src/usac_acquisition_platform_msp430.c
/* MSP430F5529 acquisition hardware: ADC/DMA sampling, finite Burst outputs,
 * synchronization/event capture, and a separate IO2 timing loopback check.
 * Loopback alone requires BOOSTXL pin40/P2.5/TA2.2 wired through 2.2 kOhm
 * to pin38/P1.5/TA0.4 and forces Standby/VDRV Hi-Z before its IO2 edges.
 * That check emits no Burst; normal acquisition uses the applied profile. */
#include <msp430.h>

#include "tuss4470_configurator.h"
#include "usac_burst_plan.h"
#include "usac_capture_schedule.h"
#include "usac_acquisition_platform_msp430.h"

#define TUSS_IO1_BIT BIT4
#define TUSS_IO2_BIT BIT5
#define LOOPBACK_CAPTURE_BIT BIT5
#define LOOPBACK_TIMEOUT_TICKS 2400u
#define TUSS4470_REG_VDRV_CTRL 0x16u
#define TUSS4470_REG_TOF_CONFIG 0x1Bu
#define TUSS4470_REG_DEV_STAT 0x1Cu
#define TUSS4470_SAFE_VDRV_CTRL 0x20u
#define TUSS4470_SAFE_TOF_CONFIG 0x40u
#define CAPTURE_WAIT_LIMIT 6000000ul
#define OUT3_CAPTURE_BIT BIT3
#define OUT4_CAPTURE_BIT BIT2
#define SYNC_SLAVE_INPUT_BIT BIT1
#define SYNC_MASTER_OUTPUT_BIT BIT6
#define USAC_QUALITY_EVENT_OVERFLOW 0x00000040ul
#define USAC_QUALITY_EVENT_TIME_AMBIGUOUS 0x00000080ul

static volatile uint8_t capture_complete;
static volatile uint8_t capture_burst_complete;
static volatile uint16_t capture_trigger_sample_index;
#ifdef USAC_ENABLE_ACQUISITION
static volatile uint16_t capture_pretrigger_target;
static volatile uint8_t capture_burst_periods_remaining;
static uint8_t capture_active;
static uint8_t capture_aux_flags;
static uint8_t capture_trigger_source;
static uint32_t capture_sync_timeout_ms;
static usac_burst_plan_t capture_burst_plan;
static volatile uint32_t capture_ta0_epoch;
static volatile uint16_t capture_event_sample_interval;
static volatile uint8_t capture_event_flags;
static volatile uint8_t capture_out4_count;
static volatile uint8_t capture_out4_last_level;
static volatile uint8_t capture_sync_waiting;
static volatile uint16_t capture_sync_wait_quanta;
static usac_capture_report_t *capture_event_report;
#endif

#ifdef USAC_ENABLE_ACQUISITION
static void capture_event_append(
    uint8_t channel,
    uint8_t level_after,
    uint16_t captured_tick,
    uint16_t cctl)
{
    uint32_t epoch = capture_ta0_epoch;
    uint32_t frame_offset;
    usac_capture_event_t *event;

    if (capture_event_report == 0) {
        return;
    }
    if ((cctl & COV) != 0u) {
        capture_event_report->quality_flags |=
            USAC_QUALITY_EVENT_TIME_AMBIGUOUS;
    }
    if (((TA0CTL & TAIFG) != 0u) && (captured_tick < 0x8000u)) {
        ++epoch;
    }
    frame_offset = (epoch << 16) | captured_tick;
    if (capture_event_report->event_count >= USAC_MAX_CAPTURE_EVENTS) {
        capture_event_report->quality_flags |= USAC_QUALITY_EVENT_OVERFLOW;
        return;
    }
    event = &capture_event_report->events[capture_event_report->event_count++];
    event->channel = channel;
    event->edge = (level_after != 0u) ? 1u : 2u;
    event->capture_method = 2u;
    event->level_after = level_after;
    event->sample_index = (int32_t)(
        frame_offset / capture_event_sample_interval);
    event->subsample_tick = (uint16_t)(
        frame_offset % capture_event_sample_interval);
    event->uncertainty_ticks = 1u;
    event->frame_offset_ticks = frame_offset;
}

static void capture_events_arm(
    uint8_t aux_flags,
    uint16_t sample_interval_ticks,
    usac_capture_report_t *report)
{
    capture_event_report = report;
    capture_event_sample_interval = sample_interval_ticks;
    capture_ta0_epoch = 0ul;
    capture_event_flags = (uint8_t)(aux_flags & 0x03u);
    capture_out4_count = 0u;
    capture_out4_last_level = 0u;
    report->event_count = 0u;
    report->out3_start_level = 0xFFu;
    report->out4_start_level = 0xFFu;

    TA0CTL = TACLR;
    TA0CCTL1 = 0u;
    TA0CCTL2 = 0u;
    if ((aux_flags & 0x01u) != 0u) {
        P1DIR &= (uint8_t)~OUT3_CAPTURE_BIT;
        P1REN &= (uint8_t)~OUT3_CAPTURE_BIT;
        P1SEL |= OUT3_CAPTURE_BIT;
        TA0CCTL2 = CM_1 | CCIS_0 | SCS | CAP;
    }
    if ((aux_flags & 0x02u) != 0u) {
        P1DIR &= (uint8_t)~OUT4_CAPTURE_BIT;
        P1REN &= (uint8_t)~OUT4_CAPTURE_BIT;
        P1SEL |= OUT4_CAPTURE_BIT;
        TA0CCTL1 = CM_3 | CCIS_0 | SCS | CAP;
    }
}

static void capture_events_start(void)
{
    if ((capture_event_flags & 0x01u) != 0u) {
        capture_event_report->out3_start_level =
            (uint8_t)((P1IN & OUT3_CAPTURE_BIT) != 0u);
        TA0CCTL2 &= (uint16_t)~(CCIFG | COV);
        TA0CCTL2 |= CCIE;
    }
    if ((capture_event_flags & 0x02u) != 0u) {
        capture_event_report->out4_start_level =
            (uint8_t)((P1IN & OUT4_CAPTURE_BIT) != 0u);
        capture_out4_last_level = capture_event_report->out4_start_level;
        TA0CCTL1 &= (uint16_t)~(CCIFG | COV);
        TA0CCTL1 |= CCIE;
    }
    if (capture_event_flags != 0u) {
        TA0CTL = TASSEL_2 | MC_2 | TACLR | TAIE;
    }
}

static void capture_events_stop(void)
{
    TA0CCTL1 = 0u;
    TA0CCTL2 = 0u;
    TA0CTL = TACLR;
    capture_event_flags = 0u;
    capture_event_report = 0;
}

static void prepare_sync_pin(uint8_t trigger_source)
{
    if (trigger_source == 1u) {
        /* BOOSTXL pin-11 maps to LaunchPad P8.1.  It has no timer-capture
         * function, so the official low-to-high handshake is bounded-poll. */
        P8SEL &= (uint8_t)~SYNC_SLAVE_INPUT_BIT;
        P8DIR &= (uint8_t)~SYNC_SLAVE_INPUT_BIT;
        P8REN &= (uint8_t)~SYNC_SLAVE_INPUT_BIT;
    } else if (trigger_source == 2u) {
        /* BOOSTXL pin-13 maps to LaunchPad P2.6.  Hold it low until every
         * acquisition resource is armed, then publish one rising edge. */
        P2SEL &= (uint8_t)~SYNC_MASTER_OUTPUT_BIT;
        P2OUT &= (uint8_t)~SYNC_MASTER_OUTPUT_BIT;
        P2DIR |= SYNC_MASTER_OUTPUT_BIT;
    }
}

static uint8_t wait_for_slave_sync(uint32_t timeout_ms)
{
    uint8_t saw_low = (uint8_t)((P8IN & SYNC_SLAVE_INPUT_BIT) == 0u);
    uint16_t timeout_quanta =
        usac_sync_timeout_guarded_quanta(timeout_ms);

    if (timeout_quanta == 0u) {
        return 0u;
    }
    capture_sync_wait_quanta = 0u;
    capture_sync_waiting = 1u;
    while (capture_sync_wait_quanta < timeout_quanta) {
        if ((P8IN & SYNC_SLAVE_INPUT_BIT) == 0u) {
            saw_low = 1u;
        } else if (saw_low != 0u) {
            capture_sync_waiting = 0u;
            return 1u;
        }
    }
    capture_sync_waiting = 0u;
    return 0u;
}

