JeffZ0930wtf/TUSS4470_Jetson/firmware/src/usac_acquisition_platform_msp430.c
void usac_platform_on_aclk_quantum(void)
{
    if ((capture_sync_waiting != 0u) &&
        (capture_sync_wait_quanta != 0xFFFFu)) {
        ++capture_sync_wait_quanta;
    }
}

static void finish_sync_pin(uint8_t trigger_source)
{
    if (trigger_source == 2u) {
        /* Returning low guarantees that the next master capture can emit a
         * new low-to-high transition instead of inheriting a stale high. */
        P2OUT &= (uint8_t)~SYNC_MASTER_OUTPUT_BIT;
    }
}

static void configure_burst_outputs(const usac_burst_plan_t *plan)
{
    P2OUT |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    P2DIR |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    P2SEL &= (uint8_t)~(TUSS_IO1_BIT | TUSS_IO2_BIT);
    TA2CTL = TACLR;
    TA2CCR0 = (uint16_t)(plan->period_ticks - 1u);
    TA2CCTL0 = CCIE;
    TA2CCTL1 = 0u;
    TA2CCTL2 = 0u;
    if ((plan->action_flags & USAC_BURST_USE_IO1_TIMER) != 0u) {
        TA2CCR1 = plan->io1_fall_tick;
        TA2CCR2 = plan->io2_rise_tick;
        TA2CCTL1 = OUTMOD_7 | OUT;
        TA2CCTL2 = OUTMOD_3;
    } else {
        TA2CCR2 = (uint16_t)(plan->period_ticks / 2u);
        TA2CCTL2 = OUTMOD_7 | OUT;
    }
}

static void start_burst_outputs(void)
{
    if ((capture_burst_plan.action_flags &
         USAC_BURST_USE_IO1_ENABLE) != 0u) {
        P2OUT &= (uint8_t)~TUSS_IO1_BIT;
    }
    if ((capture_burst_plan.action_flags &
         USAC_BURST_USE_IO1_TIMER) != 0u) {
        P2SEL |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    } else {
        P2SEL |= TUSS_IO2_BIT;
    }
    TA2CTL = TASSEL_2 | MC_1 | TACLR;
}
#endif
#ifndef USAC_ADC_DMA_DIAGNOSTIC
/* DMA0SZ reloads its programmed block size after a completed block transfer.
 * Preserve completion explicitly so reporting does not mistake that reload for
 * an untouched DMA transfer. */
static volatile uint8_t capture_dma0_completed;
static uint16_t pretrigger_sink;
#endif

static uint8_t read_safety_snapshot(
    const tuss4470_bus_t *bus,
    uint8_t *spi_status,
    uint8_t *dev_stat,
    uint8_t *tof_config,
    uint8_t *vdrv_ctrl)
{
    *spi_status = 0u;
    if ((bus == 0) || (bus->read == 0) ||
        (bus->read(bus->context, TUSS4470_REG_DEV_STAT, dev_stat) == 0u) ||
        (bus->read(bus->context, TUSS4470_REG_TOF_CONFIG, tof_config) == 0u) ||
        (bus->read(bus->context, TUSS4470_REG_VDRV_CTRL, vdrv_ctrl) == 0u)) {
        *spi_status = 1u;
        return 0u;
    }
    return 1u;
}

static uint8_t snapshot_is_safe(
    uint8_t spi_status,
    uint8_t dev_stat,
    uint8_t tof_config,
    uint8_t vdrv_ctrl)
{
    return (uint8_t)(
        (spi_status == 0u) &&
        ((dev_stat & TUSS4470_DEV_STAT_FAULT_MASK) == 0u) &&
        (tof_config == TUSS4470_SAFE_TOF_CONFIG) &&
        (vdrv_ctrl == TUSS4470_SAFE_VDRV_CTRL));
}

static void restore_io2_high_and_stop_timers(void)
{
    TA2CTL = TACLR;
    TA2CCTL0 = 0u;
    TA2CCTL1 = 0u;
    TA2CCTL2 = 0u;
    /* Disconnect both possible timer outputs before restoring safe-high.
     * This also terminates IO_MODE 2 with both pins high as required. */
    P2SEL &= (uint8_t)~(TUSS_IO1_BIT | TUSS_IO2_BIT);
    P2OUT |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    P2DIR |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    TA0CCTL4 = 0u;
#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active != 0u) {
        TA0CTL = TACLR;
    } else {
        TA0CTL = TASSEL_1 | MC_2 | TACLR;
    }
#else
    TA0CTL = TASSEL_1 | MC_2 | TACLR;
#endif
}

uint8_t usac_platform_run_io2_loopback(
    void *context,
    uint16_t burst_period_ticks,
    usac_loopback_report_t *report)
{
    const tuss4470_bus_t *bus = (const tuss4470_bus_t *)context;
    uint16_t saved_status;
    uint16_t start_tick;
    uint8_t index;
    uint8_t started = 0u;

    if ((report == 0) || (burst_period_ticks != 50u) ||
        (tuss4470_force_safe(bus) != TUSS4470_CONFIG_OK)) {
        return 0u;
    }
    if (read_safety_snapshot(
            bus,
            &report->pre_spi_status,
            &report->pre_dev_stat,
            &report->pre_tof_config,
            &report->pre_vdrv_ctrl) == 0u) {
        return 0u;
    }
    if (snapshot_is_safe(
            report->pre_spi_status,
            report->pre_dev_stat,
            report->pre_tof_config,
            report->pre_vdrv_ctrl) == 0u) {
        return 0u;
    }

    /* Establish the idle-high source before arming capture. This prevents the
     * input mux transition from being accepted as loopback evidence. */
    P2OUT |= TUSS_IO2_BIT;
    P2DIR |= TUSS_IO2_BIT;
    P2SEL &= (uint8_t)~TUSS_IO2_BIT;

    /* P1.5 is always an input. TA0.4 captures the physical pin38 signal. */
    P1DIR &= (uint8_t)~LOOPBACK_CAPTURE_BIT;
    P1REN &= (uint8_t)~LOOPBACK_CAPTURE_BIT;
    P1SEL |= LOOPBACK_CAPTURE_BIT;
    TA0CTL = TACLR;
    TA0CCTL4 = CM_2 | CCIS_0 | SCS | CAP;

    TA2CTL = TACLR;
    TA2CCR0 = (uint16_t)(burst_period_ticks - 1u);
    TA2CCR2 = (uint16_t)(burst_period_ticks / 2u);
    TA2CCTL2 = OUTMOD_7 | OUT;

    saved_status = __get_SR_register();
    __disable_interrupt();
    /* Capture mux setup may leave CCIFG/COV set. Discard that stale state
     * before starting the shared evidence timebase and finite waveform. */
    TA0CCTL4 &= (uint16_t)~(CCIFG | COV);
    TA0CTL = TASSEL_2 | MC_2 | TACLR;
    start_tick = TA0R;
    P2SEL |= TUSS_IO2_BIT;
    TA2CTL = TASSEL_2 | MC_1 | TACLR;
    started = 1u;
    /* Switching a pin from GPIO to OUTMOD_7 may create one transition before
     * the compare output reaches its periodic state. Wait for and discard one
     * such settling edge; only the following eight edges are evidence. */
    while ((TA0CCTL4 & CCIFG) == 0u) {
        if ((uint16_t)(TA0R - start_tick) > LOOPBACK_TIMEOUT_TICKS) {
            report->result_flags |= USAC_LOOPBACK_TIMEOUT;
            break;
        }
    }
    /* Timer_A only considers a captured value consumed after CCR is read.
     * Read the discarded startup value before clearing its flags so the first
     * evidence edge cannot be reported as a capture overflow. */
    (void)TA0CCR4;
    TA0CCTL4 &= (uint16_t)~(CCIFG | COV);
    start_tick = TA0R;
    for (index = 0u; index < USAC_LOOPBACK_EDGE_COUNT; ++index) {
        while ((TA0CCTL4 & CCIFG) == 0u) {
            if ((uint16_t)(TA0R - start_tick) > LOOPBACK_TIMEOUT_TICKS) {
                report->result_flags |= USAC_LOOPBACK_TIMEOUT;
                break;
            }
        }
        if ((report->result_flags & USAC_LOOPBACK_TIMEOUT) != 0u) {
            break;
        }
        if ((TA0CCTL4 & COV) != 0u) {
            report->result_flags |= USAC_LOOPBACK_COV_SEEN;
        }
        report->capture_ticks[index] = TA0CCR4;
        ++report->captured_edges;
        TA0CCTL4 &= (uint16_t)~(CCIFG | COV);
    }
    restore_io2_high_and_stop_timers();
    if ((saved_status & GIE) != 0u) {
        __enable_interrupt();
    }
    report->final_io2_level = (uint8_t)((P2IN & TUSS_IO2_BIT) != 0u);

