JeffZ0930wtf/TUSS4470_Jetson/firmware/src/usac_acquisition_platform_msp430.c
    if ((tuss4470_force_safe(bus) != TUSS4470_CONFIG_OK) ||
        (read_safety_snapshot(
             bus,
             &report->post_spi_status,
             &report->post_dev_stat,
             &report->post_tof_config,
             &report->post_vdrv_ctrl) == 0u) ||
        (snapshot_is_safe(
             report->post_spi_status,
             report->post_dev_stat,
             report->post_tof_config,
             report->post_vdrv_ctrl) == 0u)) {
        report->result_flags |= USAC_LOOPBACK_PREPOST_SAFETY_FAILED;
    }
    usac_loopback_evaluate(report, burst_period_ticks);
    return started;
}

static void stop_capture_hardware(void)
{
    TB0CTL = TBCLR;
    TB0CCTL0 = 0u;
    TB0CCTL1 = 0u;
    TB0CCTL2 = 0u;
    TB0CCR2 = 0u;
    DMA0CTL &= (uint16_t)~(DMAEN | DMAIE);
    DMA1CTL &= (uint16_t)~(DMAEN | DMAIE);
    ADC12CTL0 &= (uint16_t)~ADC12ENC;
#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active != 0u) {
        capture_events_stop();
    }
#endif
    restore_io2_high_and_stop_timers();
}

#ifndef USAC_ADC_DMA_DIAGNOSTIC
static uint8_t prepare_adc_dma_capture_path(void)
{
    unsigned long idle_wait = CAPTURE_WAIT_LIMIT;

    /* Every capture starts from the same hardware state.  In particular,
     * stop both DMA channels before changing DMAxTSEL or the 20-bit address
     * registers, and power-cycle ADC12_A so a completed prior conversion
     * cannot leave the edge-sensitive ADC12IFG trigger asserted. */
    TB0CTL = TBCLR;
    DMA0CTL = 0u;
    DMA1CTL = 0u;
    DMACTL0 = 0u;
    ADC12CTL0 = 0u;
    while ((ADC12CTL1 & ADC12BUSY) != 0u) {
        if (idle_wait == 0ul) {
            return 0u;
        }
        --idle_wait;
    }
    ADC12IE = 0u;
    ADC12IFG = 0u;

    P6DIR &= (uint8_t)~BIT0;
    P6SEL |= BIT0;
    ADC12CTL1 = ADC12SHP | ADC12SHS_3 | ADC12SSEL_3 | ADC12DIV_5 |
                ADC12CONSEQ_2;
    ADC12CTL2 = ADC12RES_2;
    ADC12MCTL0 = ADC12SREF_0 | ADC12INCH_0;
    ADC12CTL0 = ADC12SHT0_0 | ADC12ON;

    /* DMARMWDIS is TI's DMA4 erratum workaround for the 20-bit source and
     * destination writes below.  TB0CCR2 provides a fresh trigger every
     * sample period instead of depending on the ADC12IFG edge state. */
    DMACTL4 = DMARMWDIS;
    DMACTL0 = DMA0TSEL_8 | DMA1TSEL_8;
    __data16_write_addr((uintptr_t)&DMA0SA, (uintptr_t)&ADC12MEM0);
    __data16_write_addr(
        (uintptr_t)&DMA0DA, (uintptr_t)g_usac_capture_waveform);
    DMA0SZ = USAC_CAPTURE_SAMPLE_COUNT;
    DMA0CTL = DMASRCINCR_0 | DMADSTINCR_3 | DMAIE | DMAEN;
    __data16_write_addr((uintptr_t)&DMA1SA, (uintptr_t)&ADC12MEM0);
    __data16_write_addr(
        (uintptr_t)&DMA1DA, (uintptr_t)&pretrigger_sink);
#ifdef USAC_ENABLE_ACQUISITION
    DMA1SZ = capture_pretrigger_target;
    DMA1CTL = (capture_pretrigger_target == 0u) ? 0u :
        (DMASRCINCR_0 | DMADSTINCR_0 | DMAIE | DMAEN);
#else
    DMA1SZ = USAC_CAPTURE_DEFAULT_PRETRIGGER_COUNT;
    DMA1CTL = DMASRCINCR_0 | DMADSTINCR_0 | DMAIE | DMAEN;
#endif
    return 1u;
}
#endif

uint8_t usac_platform_capture_once(
    void *context,
    uint16_t sample_interval_ticks,
    uint16_t burst_period_ticks,
    usac_capture_report_t *report)
{
    const tuss4470_bus_t *bus = (const tuss4470_bus_t *)context;
    unsigned long wait_count = CAPTURE_WAIT_LIMIT;

    if ((bus == 0) || (bus->read == 0) || (report == 0) ||
#ifdef USAC_ENABLE_ACQUISITION
        ((capture_active != 0u) &&
         ((sample_interval_ticks < 120u) || (sample_interval_ticks > 960u) ||
          (burst_period_ticks < 24u) || (burst_period_ticks > 800u))) ||
        ((capture_active == 0u) &&
         ((sample_interval_ticks != 120u) || (burst_period_ticks != 50u)))) {
#else
        (sample_interval_ticks != 120u) ||
        (burst_period_ticks != 50u)) {
#endif
        return 0u;
    }
#ifdef USAC_ADC_DMA_DIAGNOSTIC
    uint16_t adc_sample = 0u;
    uint16_t adc_completed = 0u;
    uint16_t dma_completed = 0u;

    /* This compile-time-only diagnostic polls one software-triggered ADC12
     * conversion. It deliberately returns an incomplete capture report so
     * the host cannot store the baseline value as an ultrasonic waveform. */
    capture_burst_complete = 0u;
    capture_trigger_sample_index = 0u;
#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active == 0u) {
        capture_pretrigger_target = USAC_CAPTURE_DEFAULT_PRETRIGGER_COUNT;
        capture_burst_periods_remaining = 1u;
    }
#endif

    P6DIR &= (uint8_t)~BIT0;
    P6SEL |= BIT0;
    ADC12CTL0 &= (uint16_t)~ADC12ENC;
    ADC12CTL0 = ADC12SHT0_0 | ADC12ON;
    ADC12CTL1 = ADC12SHP | ADC12SHS_0 | ADC12SSEL_3 | ADC12DIV_5 |
                ADC12CONSEQ_0;
    ADC12CTL2 = ADC12RES_2;
    ADC12MCTL0 = ADC12SREF_0 | ADC12INCH_0;

    ADC12CTL0 |= ADC12ENC | ADC12SC;
    while (((ADC12IFG & ADC12IFG0) == 0u) && (wait_count != 0ul)) {
        --wait_count;
    }
    if ((ADC12IFG & ADC12IFG0) != 0u) {
        adc_completed = 1u;
        adc_sample = ADC12MEM0;
    } else {
        report->timed_out = 1u;
    }

    if (adc_completed != 0u) {
        g_usac_capture_waveform[0] = 0xFFFFu;
        DMA0CTL = 0u;
        DMACTL0 = DMA0TSEL_0;
        __data16_write_addr((uintptr_t)&DMA0SA, (uintptr_t)&adc_sample);
        __data16_write_addr(
            (uintptr_t)&DMA0DA, (uintptr_t)&g_usac_capture_waveform[0]);
        DMA0SZ = 1u;
        DMA0CTL = DMASRCINCR_0 | DMADSTINCR_0 | DMAEN;
        wait_count = CAPTURE_WAIT_LIMIT;
        DMA0CTL |= DMAREQ;
        while (((DMA0CTL & DMAIFG) == 0u) && (wait_count != 0ul)) {
            --wait_count;
        }
        if (((DMA0CTL & DMAIFG) != 0u) &&
            (g_usac_capture_waveform[0] == adc_sample)) {
            dma_completed = 1u;
        } else {
            report->timed_out = 1u;
        }
    }
    stop_capture_hardware();
    report->captured_samples = dma_completed;
    report->dma_remaining = g_usac_capture_waveform[0];
    report->trigger_sample_index = 0u;
    report->burst_completed = 0u;
    if ((bus->read(
             bus->context, TUSS4470_REG_DEV_STAT, &report->tuss_dev_stat) == 0u) ||
        ((report->tuss_dev_stat & TUSS4470_DEV_STAT_FAULT_MASK) != 0u)) {
        report->hardware_fault = 1u;
    }
    return 0u;
#else
    capture_complete = 0u;
    capture_dma0_completed = 0u;
    capture_burst_complete = 0u;
    capture_trigger_sample_index = 0u;
    pretrigger_sink = 0u;
#ifdef USAC_ENABLE_ACQUISITION
    report->diagnostic_flags =
        ((__get_SR_register() & GIE) != 0u) ?
            USAC_CAPTURE_DIAG_GIE_AT_ENTRY : 0u;
    report->diagnostic_timer_tick = 0u;
#endif
#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active != 0u) {
        capture_events_arm(
            capture_aux_flags, sample_interval_ticks, report);
    } else {
        report->out3_start_level = 0xFFu;
        report->out4_start_level = 0xFFu;
    }
#else
    report->out3_start_level = 0xFFu;
    report->out4_start_level = 0xFFu;
#endif

    if (prepare_adc_dma_capture_path() == 0u) {
        report->timed_out = 1u;
        stop_capture_hardware();
        return 0u;
    }

#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active != 0u) {
        configure_burst_outputs(&capture_burst_plan);
    } else
#endif
    {
        P2OUT |= TUSS_IO2_BIT;
        P2DIR |= TUSS_IO2_BIT;
        P2SEL &= (uint8_t)~TUSS_IO2_BIT;
        TA2CTL = TACLR;
        TA2CCR0 = (uint16_t)(burst_period_ticks - 1u);
        TA2CCR2 = (uint16_t)(burst_period_ticks / 2u);
        TA2CCTL0 = CCIE;
        TA2CCTL2 = OUTMOD_7 | OUT;
    }

    TB0CTL = TBCLR;
    /* Keep CCR0 solely as the 5 us period boundary. TB0.1 rises at CCR1=1
     * and resets at CCR0, giving ADC12SHS_3 one unambiguous trigger edge per
     * sample without requiring a physical Timer_B output pin. */
    TB0CCR0 = (uint16_t)(sample_interval_ticks - 1u);
    TB0CCR1 = 1u;
    TB0CCTL1 = OUTMOD_3;
    /* ADC12_A needs 102 SMCLK ticks from the tick-1 sample trigger through
     * its four-clock hold and 13-clock conversion.  Tick 111 preserves the
     * approved eight-tick guard; CCIE must stay clear so CCIFG drives DMA. */
    TB0CCR2 = 111u;
    TB0CCTL2 = 0u;
    ADC12CTL0 |= ADC12ENC;
#ifdef USAC_ENABLE_ACQUISITION
    if ((capture_active != 0u) &&
        (capture_trigger_source == 1u) &&
        (wait_for_slave_sync(capture_sync_timeout_ms) == 0u)) {
        report->sync_timed_out = 1u;
        stop_capture_hardware();
        return 0u;
    }
    if (capture_active != 0u) {
        capture_events_start();
        if (capture_trigger_source == 2u) {
            P2OUT |= SYNC_MASTER_OUTPUT_BIT;
        }
    }
    if (capture_pretrigger_target == 0u) {
        capture_trigger_sample_index = 0u;
        start_burst_outputs();
    }
#endif
    TB0CTL = TBSSEL_2 | MC_1 | TBCLR;
    while ((capture_complete == 0u) && (wait_count != 0ul)) {
        --wait_count;
    }
    if (capture_complete == 0u) {
        report->timed_out = 1u;
#ifdef USAC_ENABLE_ACQUISITION
        /* Snapshot before stop_capture_hardware() clears the evidence. The
         * values are diagnostic only and never authorize a retry or success. */
        report->diagnostic_timer_tick = TB0R;
        if ((TB0CTL & MC_3) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_TB0_RUNNING;
        }
        if ((ADC12CTL0 & ADC12ENC) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_ADC_ENABLED;
        }
        if ((ADC12IFG & ADC12IFG0) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_ADC_IFG0;
        }
        if ((DMA0CTL & DMAEN) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_DMA0_ENABLED;
        }
        if ((DMA0CTL & DMAIFG) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_DMA0_IFG;
        }
        if ((DMA1CTL & DMAIFG) != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_DMA1_IFG;
        }
        if (capture_burst_complete != 0u) {
            report->diagnostic_flags |= USAC_CAPTURE_DIAG_BURST_COMPLETE;
        }
#endif
    }
    stop_capture_hardware();
    if (capture_dma0_completed != 0u) {
        report->dma_remaining = 0u;
        report->captured_samples = USAC_CAPTURE_SAMPLE_COUNT;
    } else {
        report->dma_remaining = DMA0SZ;
        report->captured_samples =
            (uint16_t)(USAC_CAPTURE_SAMPLE_COUNT - DMA0SZ);
    }
    report->trigger_sample_index = capture_trigger_sample_index;
    report->burst_completed = capture_burst_complete;
    if ((bus->read(
             bus->context, TUSS4470_REG_DEV_STAT, &report->tuss_dev_stat) == 0u) ||
        ((report->tuss_dev_stat & TUSS4470_DEV_STAT_FAULT_MASK) != 0u)) {
        report->hardware_fault = 1u;
    }
#ifdef USAC_ENABLE_ACQUISITION
    if (capture_active != 0u) {
        return usac_capture_report_is_complete(
            report, capture_pretrigger_target);
    }
#endif
    return usac_capture_report_is_default_complete(report);
#endif
}

void __attribute__((interrupt(DMA_VECTOR))) DMA_ISR(void)
{
    switch (__even_in_range(DMAIV, DMAIV_DMA2IFG)) {
        case DMAIV_NONE:
            break;
        case DMAIV_DMA0IFG:
            TB0CTL = TBCLR;
            ADC12CTL0 &= (uint16_t)~ADC12ENC;
#ifndef USAC_ADC_DMA_DIAGNOSTIC
            capture_dma0_completed = 1u;
#endif
            capture_complete = 1u;
            break;
        case DMAIV_DMA1IFG:
#ifdef USAC_ENABLE_ACQUISITION
            capture_trigger_sample_index = capture_pretrigger_target;
            if (capture_active != 0u) {
                start_burst_outputs();
            } else {
                P2SEL |= TUSS_IO2_BIT;
                TA2CTL = TASSEL_2 | MC_1 | TACLR;
            }
#else
            capture_trigger_sample_index = USAC_CAPTURE_DEFAULT_PRETRIGGER_COUNT;
            P2SEL |= TUSS_IO2_BIT;
            TA2CTL = TASSEL_2 | MC_1 | TACLR;
#endif
            break;
        default:
            stop_capture_hardware();
            capture_complete = 1u;
            break;
    }
}

#ifdef USAC_ENABLE_ACQUISITION
void __attribute__((interrupt(TIMER0_A1_VECTOR))) TIMER0_A1_ISR(void)
{
    uint16_t captured_tick;
    uint16_t cctl;

    switch (__even_in_range(TA0IV, TA0IV_TAIFG)) {
        case TA0IV_NONE:
            break;
        case TA0IV_TACCR1:
            captured_tick = TA0CCR1;
            cctl = TA0CCTL1;
            if ((capture_event_flags & 0x02u) != 0u) {
                uint8_t level_after = (uint8_t)((cctl & CCI) != 0u);
                if (((cctl & COV) != 0u) ||
                    (level_after == capture_out4_last_level)) {
                    if (capture_event_report != 0) {
                        capture_event_report->quality_flags |=
                            USAC_QUALITY_EVENT_TIME_AMBIGUOUS;
                    }
                    TA0CCTL1 = 0u;
                } else if (capture_out4_count < 16u) {
                    capture_event_append(
                        4u, level_after, captured_tick, cctl);
                    capture_out4_last_level = level_after;
                    ++capture_out4_count;
                } else if (capture_event_report != 0) {
                    capture_event_report->quality_flags |=
                        USAC_QUALITY_EVENT_OVERFLOW;
                    TA0CCTL1 = 0u;
                }
            }
            break;
        case TA0IV_TACCR2:
            captured_tick = TA0CCR2;
            cctl = TA0CCTL2;
            if ((capture_event_flags & 0x01u) != 0u) {
                if ((cctl & COV) != 0u) {
                    if (capture_event_report != 0) {
                        capture_event_report->quality_flags |=
                            USAC_QUALITY_EVENT_TIME_AMBIGUOUS;
                    }
                } else {
                    capture_event_append(3u, 1u, captured_tick, cctl);
                }
                capture_event_flags &= (uint8_t)~0x01u;
                TA0CCTL2 = 0u;
            }
            break;
        case TA0IV_TAIFG:
            ++capture_ta0_epoch;
            break;
        default:
            if (capture_event_report != 0) {
                capture_event_report->quality_flags |=
                    USAC_QUALITY_EVENT_TIME_AMBIGUOUS;
            }
            break;
    }
}
#endif

void __attribute__((interrupt(TIMER2_A0_VECTOR))) TIMER2_A0_ISR(void)
{
#ifdef USAC_ENABLE_ACQUISITION
    if ((capture_active != 0u) &&
        (capture_burst_periods_remaining > 1u)) {
        --capture_burst_periods_remaining;
        return;
    }
#endif
    TA2CTL = TACLR;
    TA2CCTL0 = 0u;
    TA2CCTL1 = 0u;
    TA2CCTL2 = 0u;
    P2SEL &= (uint8_t)~(TUSS_IO1_BIT | TUSS_IO2_BIT);
    P2OUT |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    P2DIR |= TUSS_IO1_BIT | TUSS_IO2_BIT;
    capture_burst_complete = 1u;
}

#ifdef USAC_ENABLE_ACQUISITION
uint8_t usac_platform_capture(
    void *context,
    const usac_config_v2_t *config,
    uint8_t trigger_source,
    uint32_t sync_timeout_ms,
    usac_capture_report_t *report)
{
    const tuss4470_bus_t *bus = (const tuss4470_bus_t *)context;
    uint8_t io_mode;
    uint8_t pulse_count;
    uint8_t tof_base;
    uint8_t tof_readback = 0u;
    uint8_t cmd_trigger_armed = 0u;
    uint32_t posttrigger_ticks;
    uint8_t result;

    if ((bus == 0) || (bus->read == 0) || (bus->write == 0) ||
        (config == 0) || (report == 0) || (trigger_source > 2u) ||
        ((trigger_source == 1u) &&
         ((sync_timeout_ms == 0ul) || (sync_timeout_ms > 60000ul))) ||
        ((trigger_source != 1u) && (sync_timeout_ms != 0ul)) ||
        (config->sample_count != USAC_CAPTURE_SAMPLE_COUNT) ||
        (config->pretrigger_count >= USAC_CAPTURE_SAMPLE_COUNT)) {
        return 0u;
    }
    io_mode = (uint8_t)(config->profile.registers[4].value & 0x03u);
    pulse_count = (uint8_t)(config->profile.registers[8].value & 0x3Fu);
    posttrigger_ticks =
        (uint32_t)(USAC_CAPTURE_SAMPLE_COUNT - config->pretrigger_count) *
        config->profile.sample_interval_ticks;
    if (usac_burst_plan_build(
            io_mode,
            pulse_count,
            config->profile.burst_period_ticks,
            posttrigger_ticks,
            &capture_burst_plan) == 0u) {
        return 0u;
    }
    prepare_sync_pin(trigger_source);
    capture_pretrigger_target = config->pretrigger_count;
    capture_burst_periods_remaining = pulse_count;
    capture_aux_flags = config->aux_flags;
    capture_trigger_source = trigger_source;
    capture_sync_timeout_ms = sync_timeout_ms;
    capture_active = 1u;

