JeffZ0930wtf/TUSS4470_Jetson/firmware/src/usac_acquisition_platform_msp430.c
    /* IO_MODE 0 uses the stateful SPI enable while IO2 is still safe-high.
     * It is always cleared after the attempt, including sync/ADC timeouts. */
    tof_base = config->profile.registers[9].value;
    if ((capture_burst_plan.action_flags &
         USAC_BURST_USE_CMD_TRIGGER) != 0u) {
        if (bus->write(bus->context, TUSS4470_REG_TOF_CONFIG,
                       (uint8_t)(tof_base | 0x01u)) == 0u) {
            report->hardware_fault = 1u;
            result = 0u;
        } else {
            cmd_trigger_armed = 1u;
            if ((bus->read(bus->context, TUSS4470_REG_TOF_CONFIG,
                           &tof_readback) == 0u) ||
                ((tof_readback & 0x01u) == 0u)) {
                report->hardware_fault = 1u;
                result = 0u;
            } else {
                result = usac_platform_capture_once(
                    context,
                    config->profile.sample_interval_ticks,
                    config->profile.burst_period_ticks,
                    report);
            }
        }
    } else {
        result = usac_platform_capture_once(
            context,
            config->profile.sample_interval_ticks,
            config->profile.burst_period_ticks,
            report);
    }
    finish_sync_pin(trigger_source);
    if ((cmd_trigger_armed != 0u) &&
        ((bus->write(bus->context, TUSS4470_REG_TOF_CONFIG, tof_base) == 0u) ||
         (bus->read(bus->context, TUSS4470_REG_TOF_CONFIG,
                    &tof_readback) == 0u) ||
         (tof_readback != tof_base))) {
        report->hardware_fault = 1u;
        result = 0u;
    }
    capture_active = 0u;
    capture_aux_flags = 0u;
    capture_trigger_source = 0u;
    capture_sync_timeout_ms = 0ul;
    capture_burst_periods_remaining = 0u;
    return result;
}
#endif
